import React from 'react';

const UserDocumentation = () => {
  return (
    <div className="documentation-container">
      <h1 className="main-heading">Документація користувача</h1>

      <h2 className="section-heading">Розділ 1: Реєстрація та вхід</h2>

<h3>Реєстрація нового користувача</h3>
<p>Для створення нового облікового запису в додатку, слід:</p>
<ol>
  <li>Вибрати "Реєстрація" на головній сторінці додатку.</li>
  <li>Обрати тип користувача (студент чи викладач).</li>
  <li>Заповнити обов'язкові поля: ім'я, прізвище, по батькові, номер телефону, електронну пошту, пароль.</li>
  <li>Додати додаткові дані відповідно до вашого статусу (студент або викладач).</li>
  <li>Натиснути "Зареєструватись".</li>
</ol>

<h3>Вхід до облікового запису</h3>
<p>Для входу до вашого облікового запису, виконайте наступні кроки:</p>
<ol>
  <li>Виберіть "Увійти" на головній сторінці.</li>
  <li>Введіть вашу електронну пошту та пароль.</li>
  <li>Натисніть "Увійти".</li>
</ol>
      
      <h2 className="section-heading">Розділ 2: Додавання та редагування інформації(для викладача)</h2>
      <h3>Додавання нової інформації</h3>
      <p>Для додавання нової інформації, виконайте такі кроки:</p>
      <ol>
        <li>Увійдіть до свого облікового запису (див. Розділ 1).</li>
        <li>Перейдіть в розділ "Журнал", "План лекцій" або "Домашні завдання" в залежності від потреб.</li>
        <li>Заповніть обов'язкові поля для нової інформації (назва, опис тощо).</li>
        <li>Натисніть "Зберегти" для додавання інформації.</li>
      </ol>

      <h2 className="section-heading">Розділ 2.1: Перегляд інформації(для студента)</h2>
      <h3>Перегляд нової інформації</h3>
      <p>Для перегляду нової інформації, виконайте такі кроки:</p>
      <ol>
        <li>Увійдіть до свого облікового запису (див. Розділ 1).</li>
        <li>Перейдіть в розділ "Журнал", "План лекцій" або "Домашні завдання" в залежності від потреб.</li>
        <li>Перегняньте необхідну вам інформацію. </li>
      </ol>
      <h2 className="section-heading">Розділ 2.2: Додавання домашніх завдань (для студента)</h2>
      <h3>Додавання домашнього завдання</h3>
      <p>Для додавання нової інформації, виконайте такі кроки:</p>
      <ol>
        <li>Увійдіть до свого облікового запису (див. Розділ 1).</li>
        <li>Перейдіть в розділ "Домашні завдання".</li>
        <li>Знайдіть у переліку домашне завдання, яке хочете сдати</li>
        <li>Натисніть "Обрати файл" </li>
        <li>Натисніть "Відправити" </li>
        <li>Вчитель отримає ваше домашне завдання і після перевірки ви зможете переглянути свою оцінку в розділі "Журнал"</li>
      </ol>

      
      <h2 className="section-heading">Розділ 3: Розумний чат</h2>
      <h3>Чат з інформацією</h3>
      <p>Додаток надає можливість отримати швидку відповідь на свое запитання через чат. Для використання чату:</p>
      <ol>
        <li>Увійдіть до свого облікового запису (див. Розділ 1).</li>
        <li>Перейдіть в розділ "Чат".</li>
        <li>Напишить сове питання.</li>
        <li>Натисніть "Відправити".</li>
      </ol>

      <h2 className="section-heading">Розділ 4: Налаштування</h2>
      <h3>Зміна налаштувань профілю</h3>
      <p>Для зміни налаштувань свого профілю, виконайте такі кроки:</p>
      <ol>
        <li>Увійдіть до свого облікового запису (див. Розділ 1).</li>
        <li>Перейдіть в розділ "Налаштування".</li>
        <li>Змініть необхідні налаштування (наприклад, зміна свілової теми, мови тощо).</li>
        <li>Натисніть "Зберегти" для збереження змін.</li>
      </ol>

    </div>
  );
};

export default UserDocumentation;
